/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   cmd_ push.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: einterdi <einterdi@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/01/12 22:59:40 by einterdi          #+#    #+#             */
/*   Updated: 2022/01/12 23:02:36 by einterdi         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "push_swap.h"

/*pa : push a — взять первый элемент в верхней части b и поместить его в верхнюю часть a.
			Ничего не делать, если b пусто.
pb : push b — взять первый элемент в верхней части a и поместить его в верхнюю часть b.
			Ничего не делать, если a пусто.*/

